
public class Main {
    public static void main(String[] args) {
       /*
       Банковский сервис
            - Управление счетами (CRUD)
            - Транзакции (перевод, снять наличку, оплатить покупку)
            - Валидация (баланс не отрицательный, перевод с / на существующий счет)
            - Отчетность (проверить баланс, получить историю транзакций)
       */ 

        /*
            Юзер
                - ИМЯ
                - пароль
                - почту
                - типы               
            Счёт
                - номер счёта
                - баланс
                - статус (активный, закрыт, заблокирован)
                - лимиты
                - тип
            Сервис валидации
                - проверить счет (баланс / лимиты / статус)
                - проверить пользователя (e-mail)
            Сервис юзер - счет
                - создавать пользователя
                - создавать счет
                - маптиь П - С
                - искать по №С
                - Репозиторий юзеров
                - Репозиторий счетов
     
            Репозиторий счетов
                - сохранить счет в б/д
                - получить счет из б/д
                - обновить баланс счета 
            Репозиторий юзеров
                - сохранить пользователя в б/д
                - получить данные пользователя из б/д
                - обновить данные пользователя в б/д
            Репозиторий транзакций
                - сохранить тразакцию
                - получить список транзакций по номеру счета
            Транзакция (2 счета)
                - дата / время
                - разные типы
                - from
                - to
                - sum
                - статус (COMPLETE, FAIL)
            Сервис отчетов 
                -  Репозиторий транзакций 
            Сервис переводов 
                - 
            Банковский сервис           
            
        */
      

    }
}